import json

donaus = {
    'จัดอบรมรถไฟฟ้า ลำปาง': 'วิทยากรให้ความรู้ในเรื่องของรถไฟฟ้า ชุดควบคุมการทำงาน วิธีการตรวจสอบอุปกรณ์ และการแก้ปัญหากับเหตุขัดข้อง ที่ศูนย์นวัตกรรมลำปาง',
    'จัดแสดงสินค้า Uniserv มช': 'นำเสนอผลงาน นวัตกรรม และผลิตภัณฑ์ที่เกี่ยวข้องกับเทคโนโลยีการลดมลพิษ ลดฝุ่น PM2.5 ระบบตรวจจับการเกิดไฟป่าบนดอยสุเทพ ระบบแจ้งเตือนระดับน้ำก่อนเกิดอุทกภัย ให้กับบุคลากรหน่วยงานภาครัฐ และภาคเอกชน',
    'จัดแสดงสินค้า ศูนย์นวัตกรรม ลำปาง': 'นำเสนอผลงาน นวัตกรรม และผลิตภัณฑ์ที่เกี่ยวข้องกับเทคโนโลยีรถไฟฟ้า ให้กับบุคลากรหน่วยงานภาครัฐ และภาคเอกชน',
    'ชุดเก็บข้อมูลการใช้พลังงานในอาคาร': 'ชุดเก็บบันทึกการใช้พลังงานภายในอาคาร เพื่อนำไปวิเคราะห์ขนาดของแบตเตอรี่ กำลังไฟฟ้าขั้นต่ำที่จะติดตั้ง และวางแผนการติดตั้งโซล่าเซลล์ให้เหมาะสมกับการใช้งาน',
    'ระบบพ่นละอองน้ำ ด่านเก็บค่าผ่านทาง': 'ออกแบบและติดตั้งระบบทดสอบอุปกรณ์เซนเซอร์ ตัวควบคุมทางกายภาพ และการควบคุมระยะไกลบนทางด่วน',
    'รถจักรยานยนต์ไฟฟ้า': 'วิจัย ออกแบบ และพัฒนาเฟิร์มแวร์ระบบควบคุมการเปิดปิดรถไฟฟ้าแบบ Key-less ระบบติดตามด้วย GPS และระบบจัดกาการรสลับใช้งานแบตเตอรี่ในระหว่างเดินทาง',
    'รถรางไฟฟ้าแห่กระทง มช': 'พัฒนาระบบขับเคลื่อนไฟฟ้าและการควบคุมพลังงานของรถรางประดับขบวนแห่กระทง มหาวิทยาลัยเชียงใหม่',
    'รถรางนำเที่ยว และรถสามล้อไฟฟ้า เทศบาลเมืองน่าน': 'ออกแบบชุดจอแสดงผลชื่อสถาณี จัดทำ Firmware จอแสดงผลเรือนไมล์แบบ LCD ระบบ GPS ติดตามตำแหน่งรถ วางระบบควบคุมยานยนต์ไฟฟ้า และเว็บแอพพลิเคชัน สำหรับติดตามรถรับส่งนักท่องเที่ยวในเขตเมืองเก่า จังหวัดน่าน',
    'ปรับปรุงระบบไฟโซล่าเซลสวนหลวง ร.9': 'ปรับปรุงระบบควบคุมพลังงาน และจัดทำหน้า Dashboard สำหรับควบคุมการเปิดปิดไฟส่องสว่างของสวนหลวง ร.9'
}

freelance = {
    'ชุดเกมฝึกการทรงตัว เวชศาสตร์ฟื้นฟู': 'ออกแบบและจัดทำ ชุดอุปกรณ์ทดสอบ และฝึกการทรงตัว ของผู้ป่วยกายภาพบำบัด; ศูนย์เวชศาสตร์ฟื้นฟู',
    'ระบบ Smart Farm เพาะเลี้ยงหนอนแมลงวันลายเสือ': 'ออกแบบและจัดทำ ชุดอุปกรณ์พร้อมเซ็นเซอร์และระบบควบคุมแบบ IoT สำหรับเพาะเลี้ยงหนอนแมลงวันลายเสือ; วิทยาลัยนานาชาตินวัตกรรมดิจิทัล',
    'ชุดเซ็นเซอร์ตรวจวัดคุณภาพน้ำ': 'ออกแบบและจัดทำ ชุดเซ็นเซอร์วัดทดสอบคุณภาพน้ำ ส่งข้อมูลขึ้น Cloud; บริษัท เพชรหิรัญ เอ็นจิเนียริ่ง เซอร์วิส จำกัด',
    'ระบบ Smart Power Station': 'ออกแบบและจัดทำ ตู้ควบคุมระบบพลังงานไฟฟ้าสำหรับลานจอดรถขนตู้คอนเทรนเนอร์แช่เย็น รับส่งข้อมูลคำสั่งตัดไฟ และปริมาณการใช้พลังงานแบบออนไลน์ผ่านเว็บแอพพลิเคชัน; บริษัท ตองแปด โลจิสติกส์ จำกัด',
    'จัดทำ Firmware จอแสดงผล': 'ออกแบบและจัดทำ Firmware สำหรับแสดงผลข้อมูลจาก API ; บริษัท ไอเดีย เฮ้าส์ เซ็นเตอร์ จำกัด'
}

donaus_sorted = dict(sorted(donaus.items()))
freelance_sorted = dict(sorted(freelance.items()))

print('--- donaus ---')
for k, v in donaus_sorted.items():
    print(f'        "{k}": "{v}",')

print('--- freelance ---')
for k, v in freelance_sorted.items():
    print(f'        "{k}": "{v}",')
